Catalogs/ТрудовыеФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТрудовыеФункции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПрофессиональнойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодПоОКЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьКлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКЗ2026</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТрудовыеФункции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	УстановитьОтобрПредопределенных = Истина;
	Если Параметры.Свойство("ПоказыватьТрудовыеФункцииДоговоровГПХ") Тогда
		Если Параметры.ПоказыватьТрудовыеФункцииДоговоровГПХ = Истина Тогда
			УстановитьОтобрПредопределенных = Ложь;
		КонецЕсли;
		Параметры.Отбор.Удалить("ПоказыватьТрудовыеФункцииДоговоровГПХ");
	КонецЕсли;
	
	Если УстановитьОтобрПредопределенных Тогда
		Параметры.Отбор.Вставить("Предопределенный", Ложь);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ВАрхиве") Тогда
		Параметры.Отбор.Вставить("ВАрхиве", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

Процедура ЗагрузитьКлассификатор() Экспорт
	
	ИменаПредопределенныхДанных = "ДГПХ,ДАВТ,ДОИП,ИЗЛД,ЛДПИ,ДГПХФЛНС,ДАВТФЛНС";
	НаименованияЭлементов = НаименованияПредопределенныхЭлементов();
	
	Для Каждого ИмяДанных Из СтрРазделить(ИменаПредопределенныхДанных, ",") Цикл
		
		Попытка
			СсылкаСправочника = ПредопределенноеЗначение("Справочник.ТрудовыеФункции." + ИмяДанных);
			ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		Исключение
			ОбъектСправочника = Справочники.ТрудовыеФункции.СоздатьЭлемент();
			ОбъектСправочника.ИмяПредопределенныхДанных = ИмяДанных;
		КонецПопытки;
		
		ОбъектСправочника.КодПрофессиональнойДеятельности = ИмяДанных;
		ОбъектСправочника.Наименование = НаименованияЭлементов.Получить(ИмяДанных);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованияПредопределенныхЭлементов()
	
	НаименованияЭлементов = Новый Соответствие;
	НаименованияЭлементов.Вставить("ДГПХ", НСтр("ru = 'Договор (работы, услуги)'"));
	НаименованияЭлементов.Вставить("ДАВТ", НСтр("ru = 'Договор авторского заказа'"));
	НаименованияЭлементов.Вставить("ДОИП", НСтр("ru = 'Договор об отчуждении исключительного права на произведения науки, литературы, искусства'"));
	НаименованияЭлементов.Вставить("ИЗЛД", НСтр("ru = 'Издательский лицензионный договор'"));
	НаименованияЭлементов.Вставить("ЛДПИ", НСтр("ru = 'Лицензионный договор о предоставлении права использования произведения науки, литературы, искусства,'"));
	НаименованияЭлементов.Вставить("ДГПХФЛНС", НСтр("ru = 'Договор (работы, услуги), страхование от несчастных случаев'"));
	НаименованияЭлементов.Вставить("ДАВТФЛНС", НСтр("ru = 'Договор авторского заказа, страхование от несчастных случаев'"));
	
	Возврат НаименованияЭлементов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
